Table of Contents
 Class WindowVisibilityHelper
Namespace
IdeaStatiCa.BimApiLink.Utils
Assembly
IdeaStatiCa.BimApiLink.dll
public static class WindowVisibilityHelper
Inheritance
object
WindowVisibilityHelper
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Methods
 AttachThreadInput(uint, uint, bool)
public static extern bool AttachThreadInput(uint idAttach, uint idAttachTo, bool fAttach)
Parameters
idAttach uint
idAttachTo uint
fAttach bool
Returns
bool
 BringWindowToTop(IntPtr)
public static extern bool BringWindowToTop(IntPtr hWnd)
Parameters
hWnd IntPtr
Returns
bool
 BringWindowToTop(HandleRef)
public static extern bool BringWindowToTop(HandleRef hWnd)
Parameters
hWnd HandleRef
Returns
bool
 ForceForegroundWindow(IntPtr)
public static void ForceForegroundWindow(IntPtr hWnd)
Parameters
hWnd IntPtr
 GetCurrentThreadId()
public static extern uint GetCurrentThreadId()
Returns
uint
 GetForegroundWindow()
public static extern IntPtr GetForegroundWindow()
Returns
IntPtr
 GetWindowThreadProcessId(IntPtr, IntPtr)
public static extern uint GetWindowThreadProcessId(IntPtr hWnd, IntPtr ProcessId)
Parameters
hWnd IntPtr
ProcessId IntPtr
Returns
uint
 ShowWindow(IntPtr, uint)
public static extern bool ShowWindow(IntPtr hWnd, uint nCmdShow)
Parameters
hWnd IntPtr
nCmdShow uint
Returns
bool
 Edit this page